#include "dialog.h"
#include "ui_dialog.h"
#include "QMessageBox"
#include "QDebug"


/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：构造函数
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
Dialog::Dialog(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::Dialog)
{
    ui->setupUi(this);
    ui->proBar_UrlAnalysis->setRange(0,100);
    ui->lineEditURL->setText("https://www.baidu.com");
}


/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：析构函数
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
Dialog::~Dialog()
{
    delete ui;
}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：URL 粘贴按钮事件
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbPaste_clicked()
{
    //QMessageBox::about(this,tr("提示信息"),tr("更新成功"));


    // 获取需要请求的URL地址
    QString url;
    url= ui->lineEditURL->text();
    //edtURL.GetWindowTextW(url);
    // 构造Http客户端，发起请求
    WinHttpClient client(url.toStdWString(),HtmlRequestProgress);
    client.SendHttpRequest();

    //收集服务器返回的Http头和内容
    wstring httpResponseHeader = client.GetResponseHeader();
    wstring httpResponseContent = client.GetResponseContent();

    //把Http头和内容显示在Tab标签页的文本框中
    ui->textEditHead->setText(QString::fromStdWString(httpResponseHeader));
    ui->textEditBody->setText(QString::fromStdWString(httpResponseContent));
    //return false;
}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：清除URL输入框信息按钮事件
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pb_Clear_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：开始分析URL按钮事件
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pb_go_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：停止分析URL按钮事件
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pb_Stop_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 头清空分析结果按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnHeadClear_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 头复制分析结果按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnHeadCopy_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 头另存为分析结果按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnHeadSave_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 内容搜索按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnBodySearch_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 内容提取按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnBodyExtract_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 内容清除按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnBodyClear_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 内容复制按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnBodyCopy_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 内容另存为按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnBodySave_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 分析结果清空提取按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnGetClear_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 分析结果复制按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnGetCopy_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 分析结果另存为按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnGetSave_clicked()
{

}

/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：HTML 分析结果迅雷下载按钮
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
void Dialog::on_pbtnGetDown_clicked()
{

}


/** ***********************************************************************************
 *@程序作者：赵进军
 *@函数功能：URL分析过程进度回调
 *@参数说明：
 *@注意事项：
 *@创建日期：
 *************************************************************************************/
bool Dialog::HtmlRequestProgress(double progress)
{
    //double kk=progress;
    //std::cout<<"dsadsa";

    //ui->proBar_UrlAnalysis->setValue(static_cast<int>(progress));

    qDebug("intensity:%d",progress);
    return true;
}

void Dialog::on_proBar_UrlAnalysis_valueChanged(int value)
{
    //ui->proBar_UrlAnalysis->setValue(static_cast<int>(value));
}
